// 1. Создать пустой массив, с помощью push
// добавить в него цифры от 1 до 15

// const arr = [];

//  for (i = 1; i <=15; i++) {
//    arr.push(i);
//  }

//  console.log(arr);

//  2. Добавить значение 0 в начало в массив из пред задания

// arr.unshift(0);

// console.log(arr);

// 3. Удалить один элемент с конца из массива пред задания

// arr.pop();

// console.log(arr);

// 4. Удалить один элемент где нибудь в середине (splice) 
// из массива пред задания

// arr.splice(7, 1);

// console.log(arr);

// 5. Добавить цифру 5 в середину массива (splice) из пред задания

// arr.splice(7, 0, 5);

// console.log(arr);

// 6. Клонировать весь массив (slice или Object.assign) из пред задания

// const cloneArr = arr.slice();

// console.log(cloneArr);

// 7. У клона массива пред задания удалить первую половину элементов 
// (индексы от 0 до array.length/2 - 1)

// cloneArr.splice(0, cloneArr.length/2);

// console.log(cloneArr);

/////////////////////////////////////////////////////////////////////////

// 8. Создать пустой массив на 8 empty ячеек

